In [6]:
import pandas as pd

df = pd.read_csv('../data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
type(df)

pandas.core.frame.DataFrame

## 聚合统计

In [8]:
# 乘客的平均年龄
df['Age'].mean()

29.69911764705882

In [9]:
# 乘客年龄和票价的中位数
df[['Age','Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [10]:
# 对数据进行描述
df[['Age','Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

## groupby 分组计算

In [27]:
df.groupby('Sex').size()

Sex
female    314
male      577
dtype: int64

In [21]:
# 分组并查看
print(df.groupby('Sex').groups)

{'female': [1, 2, 3, 8, 9, 10, 11, 14, 15, 18, 19, 22, 24, 25, 28, 31, 32, 38, 39, 40, 41, 43, 44, 47, 49, 52, 53, 56, 58, 61, 66, 68, 71, 79, 82, 84, 85, 88, 98, 100, 106, 109, 111, 113, 114, 119, 123, 128, 132, 133, 136, 140, 141, 142, 147, 151, 156, 161, 166, 167, 172, 177, 180, 184, 186, 190, 192, 194, 195, 198, 199, 205, 208, 211, 215, 216, 218, 229, 230, 233, 235, 237, 240, 241, 246, 247, 251, 254, 255, 256, 257, 258, 259, 264, 268, 269, 272, 274, 275, 276, ...], 'male': [0, 4, 5, 6, 7, 12, 13, 16, 17, 20, 21, 23, 26, 27, 29, 30, 33, 34, 35, 36, 37, 42, 45, 46, 48, 50, 51, 54, 55, 57, 59, 60, 62, 63, 64, 65, 67, 69, 70, 72, 73, 74, 75, 76, 77, 78, 80, 81, 83, 86, 87, 89, 90, 91, 92, 93, 94, 95, 96, 97, 99, 101, 102, 103, 104, 105, 107, 108, 110, 112, 115, 116, 117, 118, 120, 121, 122, 124, 125, 126, 127, 129, 130, 131, 134, 135, 137, 138, 139, 143, 144, 145, 146, 148, 149, 150, 152, 153, 154, 155, ...]}

In [31]:
# 多列分组
df.groupby(['Sex','Pclass']).count()

               PassengerId  Survived  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex    Pclass
female 1                94        94    94   85     94     94      94    94
       2                76        76    76   74     76     76      76    76
       3               144       144   144  102    144    144     144   144
male   1               122       122   122  101    122    122     122   122
       2               108       108   108   99    108    108     108   108
       3               347       347   347  253    347    347     347   347

               Cabin  Embarked
Sex    Pclass
female 1          81        92
       2          10        76
       3           6       144
male   1          95       122
       2           6       108
       3           6       347

In [11]:
# 根据性别对年龄进行分组，并求平均数
df[['Sex','Age']].groupby('Sex').mean()

              Age
Sex
female  27.915709
male    30.726645

## 按类别计算记录数

In [12]:
df['Pclass'].value_counts() # value_counts（）方法计算列中每个类别的记录数

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [18]:
df.groupby('Pclass')['Pclass'].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64